{"id":17,"date":"2020-08-30T08:30:51","date_gmt":"2020-08-30T08:30:51","guid":{"rendered":"http:\/\/www.rihakenya.org\/?page_id=17"},"modified":"2020-11-06T09:35:29","modified_gmt":"2020-11-06T09:35:29","slug":"about-us","status":"publish","type":"page","link":"http:\/\/www.rihakenya.org\/about-us\/","title":{"rendered":"ABOUT US"},"content":{"rendered":"<p>Rural Humanitarian Initiative Association (RIHA) is a self-help rural community based development-oriented organization, non-political, non-governmental, non-profit making and non-denominational organization. The organization was founded in 2011 by Engineer Alexis Bandyatuyaga and is registered in Kenya in accordance to Section 10 of the Non-governmental Organizations Co-ordination Act, Cap 19 of the laws of Kenya and was issued with Registration Number R.34882. It seeks to improve the lives of the vulnerable communities in the rural areas through poverty reduction, economic growth and social transformation. It creates programs and projects with the community and for the community that improve the lives of those in need like rural women, people with disabilities (PWD), the sick and HIV\/AIDS patients, orphans and vulnerable children (OVC). RIHA Kenya mainly seeks to positively impact the lives of vulnerable people in Turkana, West Pokot, Baringo, Samburu and Kajiado counties. In doing this, the organization seeks to eliminate hunger, poverty and violence in the rural areas through sustainable agriculture, provision of water, sanitation &amp;hygiene, education, healthcare, humanitarian help, food security and environmental conservation. All its initiatives do not discriminate on the basis of religion, politics, ethnicity, race, color, creed, national origin, age, disability, marital status, gender, language or any reason whatsoever. It believes that everyone regardless of any status should be treated equally with respect and dignity.<br \/>\nRural Humanitarian Initiative Association (RIHA) was founded and registered in Kenya in 2011 by Engineer Alexis Bandyatuyaga. The organization seeks to eliminate hunger, poverty and violence in the rural areas through sustainable agriculture, provision of water, sanitation &amp;hygiene, education, healthcare, humanitarian help, food security and environmental conservation.<br \/>\nAccording to The United Nations World Water Development Report 2018, an estimated 3.6 billion people (nearly half the global population) live in areas that are potentially water-scarce at least one month per year, and this population could increase to some 4.8-5.7 billion by 2050. In Africa, rapid population increase, inappropriate water governance and institutional arrangements, depletion of water resources through pollution, environmental degradation, deforestation, and low and unsustainable financing of investments in water supply and sanitation are some of the main threats that pose challenges to the management of water resources on the continent (Network of African Science Academies, 2014). In Kenya, the cost of accessing water from an improved source such as piped water is a barrier to poor households where there are no pro-poor tariffs (Development Initiatives 2018).<br \/>\nDespite the crucial importance of water, rural Turkana people do not have sufficient supply of the commodity with its supply being skewed in favor of urban areas of the county. This has necessitated the conceptualization of this proposal to address such inequality by drilling a borehole to help the rural residents living in Katum, Turkana County.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Rural Humanitarian Initiative Association (RIHA) is a self-help rural community based development-oriented organization, non-political, non-governmental, [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":416,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_mo_disable_npp":""},"_links":{"self":[{"href":"http:\/\/www.rihakenya.org\/wp-json\/wp\/v2\/pages\/17"}],"collection":[{"href":"http:\/\/www.rihakenya.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"http:\/\/www.rihakenya.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"http:\/\/www.rihakenya.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/www.rihakenya.org\/wp-json\/wp\/v2\/comments?post=17"}],"version-history":[{"count":5,"href":"http:\/\/www.rihakenya.org\/wp-json\/wp\/v2\/pages\/17\/revisions"}],"predecessor-version":[{"id":1027,"href":"http:\/\/www.rihakenya.org\/wp-json\/wp\/v2\/pages\/17\/revisions\/1027"}],"wp:featuredmedia":[{"embeddable":true,"href":"http:\/\/www.rihakenya.org\/wp-json\/wp\/v2\/media\/416"}],"wp:attachment":[{"href":"http:\/\/www.rihakenya.org\/wp-json\/wp\/v2\/media?parent=17"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}