{"id":23,"date":"2020-08-30T08:36:17","date_gmt":"2020-08-30T08:36:17","guid":{"rendered":"http:\/\/www.rihakenya.org\/?page_id=23"},"modified":"2020-09-16T13:16:56","modified_gmt":"2020-09-16T13:16:56","slug":"make-donations","status":"publish","type":"page","link":"http:\/\/www.rihakenya.org\/make-donations\/","title":{"rendered":"MAKE DONATIONS"},"content":{"rendered":"\n<p><strong>Appreciation<\/strong><br>Welcome and thank you for your donations in advance!<br>Your donations will empower the poorest, the oppressed and the disadvantaged rural people to stand up against hunger, poverty and violence.<\/p>\n\n\n\n<p>At RIHA KENYA we ensure that 100% of your donations are directly aimed at supporting a project to help those most in need in the rural  and marginalized areas of Kenya.  As we are a growing and flexible organisation we can work directly with you to find a project in the rural areas that is relevant, interesting and provides the most profound effect on the poor people within your given resources.  We are firmly rooted locally with our structures up to the grassroots, making it simple for us to succeed in our rural projects.<\/p>\n\n\n\n<p>We shall give you regular updates from the field on the project of your donation. We can also arrange for you to directly visit a project on the ground to see how your donation is at work.<strong> <\/strong>RIHA KENYA is firmly rooted locally with its structures up to the grassroots, making it simple to succeed in rural projects.<\/p>\n\n\n\n<p><strong>Please help<\/strong><br>We help the poorest, the oppressed and the disadvantaged rural people to help themselves come out of their sufferings; please allow us to help them by making your generous contributions to us in Cash, in Gifts, in Kind or by remembering us in your Will. No one is so poor to help people in need.<\/p>\n\n\n\n<p>We welcome contributions from around the world; whether you are an individual, a family, a corporation or company, a church, a foundation, an institution, an organisation or association, a club, or a rock star, feel free to help us. We cannot operate and expand without your kind support.<br><br><strong>Ways of Support<\/strong><\/p>\n\n\n\n<p>There are several ways in which you can support the activities of RIHA KENYA; open your heart by:-<\/p>\n\n\n\n<ul><li>Giving a cash or material gift donation for specific activity or general support.<\/li><li>Giving a one time, monthly or yearly donations towards a specific activity or general support.<\/li><li>Remembering us in your will.<\/li><li>Fundraising for RIHA KENYA.<\/li><li>Buying our stuff to support our specific activity or general support.<\/li><li>Volunteering to work with RIHA KENYA for a period of time.<\/li><\/ul>\n\n\n\n<p><strong>Please Make a Donation today!<\/strong><br>No amount is too small which cannot be welcomed by RIHA KENYA, because we believe that collecting one stick at a time makes a bundle that makes a fire. Thus your contributions however small will have a great impact on the lives of the poorest, the oppressed and the disadvantaged rural people here in Kenya. We need your donations; act now in any way possible.<\/p>\n\n\n\n<p><strong>Bank Details<\/strong><br>Donate today! Every dollar, euro or shilling is important to us.<br>There are three ways of giving donations to us:<br>1. Through our U.S.A Fiscal agent; this is a registered 501(c) (3) nonprofit organization. Confidentially, the contact can be given to you in consultation with us. This is helpful for those in the U.S.A.<\/p>\n\n\n\n<p><strong>2. <\/strong>By contacting our office directly. This is helpful for those in Kenya.<br><strong>3.<\/strong> Funds can be wired directly to our bank account by Telegraphic money transfer in dollars, Euros or Kenyan Shillings. This    is also helpful for those who like to be treated secret or anonymous in their contributions. Please, contact us for our bank details.<br>Thank you in advance for your generosity in helping us to help the poorest, the oppressed and the disadvantaged people in the marginalized and rural areas.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>AppreciationWelcome and thank you for your donations in advance!Your donations will empower the poorest, the [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_mo_disable_npp":""},"_links":{"self":[{"href":"http:\/\/www.rihakenya.org\/wp-json\/wp\/v2\/pages\/23"}],"collection":[{"href":"http:\/\/www.rihakenya.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"http:\/\/www.rihakenya.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"http:\/\/www.rihakenya.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/www.rihakenya.org\/wp-json\/wp\/v2\/comments?post=23"}],"version-history":[{"count":3,"href":"http:\/\/www.rihakenya.org\/wp-json\/wp\/v2\/pages\/23\/revisions"}],"predecessor-version":[{"id":928,"href":"http:\/\/www.rihakenya.org\/wp-json\/wp\/v2\/pages\/23\/revisions\/928"}],"wp:attachment":[{"href":"http:\/\/www.rihakenya.org\/wp-json\/wp\/v2\/media?parent=23"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}